{
  "phoneme_to_id": {
    "a": 0,
    "aa": 1,
    "ae": 2,
    "ax": 3,
    "b": 4,
    "bh": 5,
    "c": 6,
    "ch": 7,
    "d": 8,
    "dh": 9,
    "dx": 10,
    "dxh": 11,
    "dxhq": 12,
    "dxq": 13,
    "ee": 14,
    "ei": 15,
    "f": 16,
    "g": 17,
    "gh": 18,
    "gq": 19,
    "h": 20,
    "hq": 21,
    "i": 22,
    "ii": 23,
    "j": 24,
    "jh": 25,
    "k": 26,
    "kh": 27,
    "khq": 28,
    "kq": 29,
    "l": 30,
    "lx": 31,
    "m": 32,
    "mq": 33,
    "n": 34,
    "ng": 35,
    "nj": 36,
    "nx": 37,
    "o": 38,
    "ou": 39,
    "p": 40,
    "ph": 41,
    "q": 42,
    "r": 43,
    "rq": 44,
    "s": 45,
    "sh": 46,
    "sx": 47,
    "t": 48,
    "th": 49,
    "tx": 50,
    "txh": 51,
    "u": 52,
    "uu": 53,
    "w": 54,
    "y": 55,
    "z": 56
  },
  "id_to_phoneme": {
    "0": "a",
    "1": "aa",
    "2": "ae",
    "3": "ax",
    "4": "b",
    "5": "bh",
    "6": "c",
    "7": "ch",
    "8": "d",
    "9": "dh",
    "10": "dx",
    "11": "dxh",
    "12": "dxhq",
    "13": "dxq",
    "14": "ee",
    "15": "ei",
    "16": "f",
    "17": "g",
    "18": "gh",
    "19": "gq",
    "20": "h",
    "21": "hq",
    "22": "i",
    "23": "ii",
    "24": "j",
    "25": "jh",
    "26": "k",
    "27": "kh",
    "28": "khq",
    "29": "kq",
    "30": "l",
    "31": "lx",
    "32": "m",
    "33": "mq",
    "34": "n",
    "35": "ng",
    "36": "nj",
    "37": "nx",
    "38": "o",
    "39": "ou",
    "40": "p",
    "41": "ph",
    "42": "q",
    "43": "r",
    "44": "rq",
    "45": "s",
    "46": "sh",
    "47": "sx",
    "48": "t",
    "49": "th",
    "50": "tx",
    "51": "txh",
    "52": "u",
    "53": "uu",
    "54": "w",
    "55": "y",
    "56": "z"
  },
  "vocab_size": 57,
  "phoneme_counts": {
    "a": 209515,
    "mq": 477,
    "g": 5706,
    "r": 21980,
    "ee": 15391,
    "j": 5167,
    "z": 300,
    "ii": 16290,
    "o": 9499,
    "q": 13115,
    "u": 7759,
    "l": 11631,
    "uu": 3775,
    "txh": 1337,
    "t": 14454,
    "dxq": 430,
    "i": 11814,
    "y": 11121,
    "dh": 2766,
    "aa": 44658,
    "k": 13148,
    "nx": 3815,
    "n": 16697,
    "sh": 4202,
    "h": 5192,
    "p": 8886,
    "d": 6149,
    "rq": 533,
    "sx": 2094,
    "c": 8008,
    "m": 11009,
    "s": 12075,
    "dx": 4232,
    "w": 11857,
    "tx": 4925,
    "ei": 939,
    "hq": 238,
    "b": 5082,
    "th": 1860,
    "kq": 142,
    "nj": 299,
    "kh": 2449,
    "khq": 126,
    "gh": 1153,
    "bh": 2331,
    "ch": 658,
    "dxhq": 189,
    "ou": 576,
    "ph": 1501,
    "f": 235,
    "gq": 59,
    "ng": 87,
    "jh": 892,
    "ax": 110,
    "dxh": 726,
    "lx": 2073,
    "ae": 25
  }
}